app/controllers/item_details_controller.rb

SELECT "item_details".* FROM "item_details"
---
    def index
        render json: ItemDetail.all