app/controllers/users_controller.rb

INSERT INTO "users" ("username", "user_type", "created_at", "updated_at", "password_digest", "name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        user = User.create!(user_params)